//=========================================================
// TS_TitleCustomize
//=========================================================

/*:ja
 * @plugindesc
 * タイトル画面の表示改良
 */




(function() {
	
	
	
	//****************************************************************************
	// タイトル画面拡張
	//****************************************************************************
	
	//---------------------------------
	// Window_TitleCommandの変更
	//---------------------------------
	// 書き換え
	Window_TitleCommand.prototype.updatePlacement = function() {
		this.x = (Graphics.boxWidth - this.width) / 2 - 300;
		this.y = Graphics.boxHeight - this.height - 150;
	};

})();
